tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/0_org/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0; 

boundaryField
{
    outlet 
    {
        type            zeroGradient;
    }
    inlet 
    {
        type            fixedValue;
        value           uniform c_inlet;
    }
    walls 
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
