tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/constant/dynamicMeshDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;

dynamicRefineFvMeshCoeffs
{
    refineInterval  200;
    field           eps;
    lowerRefineLevel 0.01;
    upperRefineLevel 0.99;
    unrefineLevel   1.01;
    nBufferLayers   1;
    maxRefinement   1;
    maxCells        20000000;
    correctFluxes
    (
        (
            phi
            U
        )
    );
    dumpLevel       true;
}


// ************************************************************************* //
