tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    outlet
    {
        type            patch;
        nFaces          750;
        startFace       289360;
    }
    inlet
    {
        type            patch;
        nFaces          750;
        startFace       290110;
    }
    walls
    {
        type            patch;
        nFaces          22780;
        startFace       290860;
    }
)


// ************************************************************************* //
