tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/constant/thermoPhysicalProperties0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoPhysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solutionSpecies
{
   C 
   {
      D    D  [0 2 -1 0 0 0 0] Diff;
   }


}

kineticPhases
{
}

kineticPhaseReactions
{
  calcite
  {
      species
      {
          C
          {
              scoeff s_coeff;
              ki ki [0 1 -1 0 0 0 0] k_reac;
          }
      }
      k0 k0 [0 -2 -1 0 1 0 0] 0;
}

// ************************************************************************* //
