tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
nu              nu [ 0 2 -1 0 0 0 0 ] 2.61e-6;

Mw Mw [ 1 0 0 0 -1 0 0 ] 100;
rhos             rhos [ 1 -3 0 0 0 0 0 ] 2710;

kf kf [0 -2 0 0 0 0 0] 1e12;


// ************************************************************************* //
