tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/system/fvSolutionAMRInit
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       0.001;
            relTol          0;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nBottomSweeps   2;
            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }

        tolerance       0.0001;
        relTol          0;
        maxIter         100;
    }

    p
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       0.001;
            relTol          0;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nBottomSweeps   2;
            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }

        tolerance       0.0001;
        relTol          0;
        maxIter         100;
    }


    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    Yi 
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0.1;
    }


    eps 
    {
        solver          BiCGStab;//PCG;
        preconditioner  DILU;//DIC;
        tolerance       1e-7;
        relTol          0;
    }
}


SIMPLE
{
    nNonOrthogonalCorrectors 0;

    nS 1;
    cS 0.5;

	residualControl
	{
		p               1e-5;
		U               1e-5;
	}
}

STEADYSTATE
{
    VoS iVoS;
    nNonOrthogonalCorrectors 0;
    nCorrectors 1;

	residualControl
	{
		p               1e-5;
		U               1e-5;
                C               1e-5;
	}
}

relaxationFactors
{
   U 0.3;
   p 0.3;
   C 0.3;
}

cache
{
    grad(U);
    grad(p);
}


// ************************************************************************* //
