tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue eps 1 
);

regions
(
    boxToCell
    {
        box ( -3e-4 -3e-4 -1e-4 ) ( 3e-4 3e-4 1e-4 );
        fieldValues
        (
            volScalarFieldValue eps 1e-6
        );
    }
 );


// ************************************************************************* //
